[
   {
      "name":"Fortnite",
      "year":2017,
      "genre":"Battle royale",
      "description":"In Fortnite, players collaborate to survive in an open-world environment, by battling other characters who are controlled either by the game itself, or by other players. The single-player or co-operative (played with friends) mode, called 'Save the World', involves fighting off zombie-like creatures.",
      "image":"https://i.pinimg.com/736x/ca/c7/d6/cac7d68da439ca85c36ffbcac7edbcee.jpg"
   },
   {
      "name":"World of Warcraft",
      "year":2004,
      "genre":"Massively multiplayer online role-playing",
      "description":"Set in the fictional world of Azeroth, WoW allows players to create avatar-style characters and explore a sprawling universe while interacting with nonreal players—called nonplayer characters (NPCs)—and other real-world players (PCs).",
      "image":"https://upload.wikimedia.org/wikipedia/en/6/65/World_of_Warcraft.png"
   },
   {
      "name":"League of Legends",
      "year":2009,
      "genre":"Multiplayer online battle arena",
      "description":"League of Legends is a team-based strategy game where two teams of five powerful champions face off to destroy the other's base. Choose from over 140 champions to make epic plays, secure kills, and take down towers as you battle your way to victory.",
      "image":"https://cdn1.epicgames.com/salesEvent/salesEvent/EGS_LeagueofLegends_RiotGames_S2_1200x1600-7fd64f0f7b674900bdd172967865d545"
   },
   {
      "name":"Counter-Strike",
      "year":2012,
      "genre":"First-person shooter",
      "description":"The game puts two teams, Terrorists and Counter-Terrorists, against each other in different objective-based game modes. The game modes involve the Terrorists planting a bomb while Counter-Terrorists attempt to stop them, or Counter-Terrorists attempting to rescue hostages that the Terrorists have captured.",
      "image":"https://upload.wikimedia.org/wikipedia/en/4/43/Counter-Strike_Source_%28box_art%29.jpg"
   },
   {
      "name":"Dota 2",
      "year":2013,
      "genre":"Multiplayer online battle arena",
      "description":"Dota 2 is a multiplayer online battle arena (MOBA) video game in which two teams of five players compete to destroy a large structure defended by the opposing team known as the \"Ancient\" whilst defending their own.",
      "image":"https://static-cdn.jtvnw.net/ttv-boxart/29595-272x380.jpg"
   },
   {
      "name":"Overwatch",
      "year":2016,
      "genre":"First-person shooter",
      "description":"Overwatch is an online team-based game generally played as a first-person shooter. The game featured several different game modes, principally designed around squad-based combat with two opposing teams of six players each.",
      "image":"https://m.media-amazon.com/images/I/91lid74MqmL.jpg"
   },
   {
      "name":"PUBG",
      "year":2017,
      "genre":"Battle royale",
      "description":"PUBG is a player versus player shooter game in which up to one hundred players fight in a battle royale, a type of large-scale last man standing deathmatch where players fight to remain the last alive. Players can choose to enter the match solo, duo, or with a small team of up to four people.",
      "image":"https://m.media-amazon.com/images/M/MV5BMTRkMjg2NDEtYzIxYi00MzZlLTllNmQtOTE4YWMzNjIwZDNkXkEyXkFqcGdeQXVyNTgyNTA4MjM@._V1_.jpg"
   },
   {
      "name":"Halo",
      "year":2001,
      "genre":"First-person shooter",
      "description":"Halo is set in the twenty-sixth century, with the player assuming the role of the Master Chief, a cybernetically enhanced supersoldier. The Chief is accompanied by Cortana, an artificial intelligence. Players battle aliens as they attempt to uncover the secrets of the eponymous Halo, a ring-shaped artificial world.",
      "image":"https://upload.wikimedia.org/wikipedia/en/1/14/Halo_Infinite.png"
   },
   {
      "name":"Destiny",
      "year":2014,
      "genre":"First-person shooter",
      "description":"Set in a \"mythic science fiction\" world, the game features a multiplayer \"shared-world\" environment with elements of role-playing games. Activities in Destiny are divided among player versus environment (PvE) and player versus player (PvP) game types.",
      "image":"https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781608874224/destiny-9781608874224_hr.jpg"
   }
]